Tekla.Structures.Drawing.ViewMarkBasicTagAttributes
The ViewMarkBasicTagAttributes class contains basic attributes for view mark tags.
Reads and modifies tag content of view mark:
using Tekla.Structures.Drawing;
namespace ExampleViewMark
{
internal class Program
{
static void Main()
{
DrawingHandler dh = new DrawingHandler();
Drawing currentDrawing = dh.GetActiveDrawing();
DrawingObjectEnumerator doe = currentDrawing.GetSheet().GetAllViews();
while (doe.MoveNext())
{
View drawingView = doe.Current as View;
ContainerElement ce = drawingView.Attributes.TagsAttributes.TagA1.TagContent;
string currentTextTagA1 = ce.GetUnformattedString();
// TagA2..TagA5 can be accessed and modified similarly
drawingView.Attributes.TagsAttributes.TagA1.TagContent.Add(new TextElement("TagA1"));
drawingView.Modify();
}
currentDrawing.CommitChanges();
// Add breakpoint here to check the tags in the drawing
View.ViewMarkTagsAttributes viewTags = new View.ViewMarkTagsAttributes
{
TagA1 = new View.ViewMarkTagAttributes(),
};
viewTags.TagA1.TagContent.Add(new TextElement("Test"));
doe.Reset();
while (doe.MoveNext())
{
View drawingView = doe.Current as View;
drawingView.Attributes.TagsAttributes = viewTags;
drawingView.Modify();
}
currentDrawing.CommitChanges();
// Add breakpoint here to check the tags in the drawing again
}
}
}

Tekla.Structures.Drawing.ViewMarkBasicTagAttributes.Offset
The offset of the mark tag.

Tekla.Structures.Drawing.ViewMarkBasicTagAttributes.Location
The location of the mark tag.

Tekla.Structures.Drawing.ViewMarkBasicTagAttributes.TagContent
The tag content.

Tekla.Structures.Drawing.ViewMarkBasicTagAttributes.#ctor
Creates a new mark tag attributes instance.

Tekla.Structures.Drawing.ViewMarkBasicTagAttributes.#ctor(Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Drawing.TagLocation,Tekla.Structures.Drawing.ContainerElement)
Creates a new mark tag attributes instance with the given offset, location and content.
offset: The offset of the mark tag to be used.
location: The location of the mark tag to be used.
tagContent: The content of the mark tag to be used.

Tekla.Structures.Drawing.ViewMarkBasicTagAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.